app/views/lists/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 3 AND "tasks"."id" = ? LIMIT 1  [["id", "3"]]
---

<% @list.tasks.incomplete.each do |task|%>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 7 AND "tasks"."completed" = 'f'
---
<div id = "completed">
<% @list.tasks.completed.each do |task|%>