app/controllers/lists_controller.rb

  def index
    @list = List.new
    @lists = List.all
    @task = Task.new
    @tasks = Task.all
---
SELECT "lists".* FROM "lists"
SELECT "tasks".* FROM "tasks"

  def create
    @list = List.create ( params[:list] )
---
INSERT INTO "lists" ("created_at", "lists", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 10 Jun 2013 17:54:04 UTC +00:00], ["lists", nil], ["title", "something"], ["updated_at", Mon, 10 Jun 2013 17:54:04 UTC +00:00]]

  def destroy
     @list = List.find (params[:id])
     @list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]

  def update
    @list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "3"]]