app/controllers/tasks_controller.rb

  def create
    @list = List.find(params[:list_id])
    @task = @list.tasks.new(params[:task])
    if @task.save
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "list_tasks" ("created_at", "date", "list_id", "task_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Jun 2013 01:43:07 UTC +00:00], ["date", nil], ["list_id", 0], ["task_id", 1], ["updated_at", Tue, 11 Jun 2013 01:43:07 UTC +00:00]]
INSERT INTO "lists" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 12 Jun 2013 10:50:58 UTC +00:00], ["title", "rjpewa"], ["updated_at", Wed, 12 Jun 2013 10:50:58 UTC +00:00]]
INSERT INTO "tasks" ("completed", "created_at", "list_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", false], ["created_at", Sun, 23 Jun 2013 13:48:58 UTC +00:00], ["list_id", 7], ["title", "eggs"], ["updated_at", Sun, 23 Jun 2013 13:48:58 UTC +00:00]]

  def complete
    @list = List.find(params[:list_id])
    @task = @list.tasks.find(params[:id])
    @task.completed = true
    @task.save
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 7 AND "tasks"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tasks" SET "completed" = 't', "updated_at" = '2013-06-23 14:11:12.319803' WHERE "tasks"."id" = 2